W6D5/cats_project/app/controllers/cats_controller.rb

  def show
    @cats = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]